[Killed] BlockStatement
src/fizzbuzz.js:1:27
-function fizzbuzz(number) {
-    var result = '';
-    if (number % 3 === 0) {
-        result += 'fizz'
-    }
-    if (number % 5 === 0) {
-        result += 'buzz'
-    }
-    return result;
-}
+function fizzbuzz(number) {}
 
 module.exports = fizzbuzz;
killedBy: Fizzbuzz gets fizzbuzz
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "fizzbuzz"
Received: undefined

[Killed] BlockStatement
src/fizzbuzz.js:3:27
 function fizzbuzz(number) {
     var result = '';
-    if (number % 3 === 0) {
-        result += 'fizz'
-    }
+    if (number % 3 === 0) {}
     if (number % 5 === 0) {
         result += 'buzz'
killedBy: Fizzbuzz gets fizzbuzz
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "fizzbuzz"
Received: "buzz"

[Killed] ConditionalExpression
src/fizzbuzz.js:3:9
 function fizzbuzz(number) {
     var result = '';
-    if (number % 3 === 0) {
+    if (false) {
         result += 'fizz'
     }
killedBy: Fizzbuzz gets fizzbuzz
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "fizzbuzz"
Received: "buzz"

[Killed] ConditionalExpression
src/fizzbuzz.js:6:9
     if (number % 3 === 0) {
         result += 'fizz'
     }
-    if (number % 5 === 0) {
+    if (false) {
         result += 'buzz'
     }
killedBy: Fizzbuzz gets fizzbuzz
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "fizzbuzz"
Received: "fizz"
